import { Link } from "react-router-dom";
import { LineHeight, Section } from "./assets/Base";

export default function App() {
    return (
        <div>
            <Section>
                <h1>Relativity Lab</h1>
                <p>آزمایشگاه اتساع زمان (نسبیت عام)</p>
            </Section>
            <Section style={{marginTop:'100vh'}}>
                <h2>ما دقیقا چه میکنیم؟</h2>
                <LineHeight>
                    <p>احتمال زیاد نام <strong>انیشتین</strong> را شنیده اید. یکی از کتاب های او<strong>نسبیت عام</strong> است. یکی از موارد جالب این کتاب مربوط</p>
                    <p>به <strong>استاع زمان</strong> میشود. برای درک این موضوع بیاید یک مثال ساده بزنیم. فرض کنید 1 ساعت روی یک سیاره دیگر باشید.</p>
                    <p>برای شما همان یک ساعت هست ولی روی زمین 10 سال گذشته! چگونه؟ به این پدیده <strong>استاع زمان میگوییم.</strong> و از اسمش معلوم است </p>
                    <p>که عامل این پدیده <strong>زمان</strong> است. اگر شما با سرعت خیلی بالا  مثلا نزدیک به سرعت نور حرکت کنید، زمان برای شما دیر میگذرد و روی زمین همان</p>
                    <p>حالت قبلیست یعنی شما جوان تر از بقیه شدید! در این وبسایت قرار است محاسبه کنیم اگر با n سرعت حرکت میکردیم، روی زمین</p>
                    <p>به ثانیه، دقیقه، ساعت، روز و سال چقدر میگذشت.</p><br />
                    <Link to="/relativity">برای شروع کلیک کنید!</Link>
                </LineHeight>
            </Section>
        </div>
    )
}